lwrp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>lwrp</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="lwrp"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-26T17:50-0700"/>
<meta name="author" content="Scott M. Likens"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">lwrp</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 LWRP Summit</a>
<ul>
<li><a href="#sec-1-1">1.1 Limitations</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Dependency Resolution</a></li>
<li><a href="#sec-1-1-2">1.1.2 Learning Curve</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> LWRP Summit</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Limitations</h3>
<div class="outline-text-3" id="text-1-1">

<p>Some of the limitations of LWRP were brought up.  The audiance appeared to be unaware not being able to use <code>include_recipe</code> or <code>require_recipe</code> or <code>values_for_platform</code>.
</p>
</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Dependency Resolution</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>It was suggested that it would be nice if we could either provide dependency resolution at the Resource level.  Such as.
</p>


<pre class="src src-ruby"><span style="color: #346604;">def</span> <span style="color: #a40000;">initialize</span>(*args)
  <span style="color: #346604;">super</span>
  <span style="color: #b35000;">@action</span> = <span style="color: #204a87; font-weight: bold;">:install</span>
  <span style="color: #b35000;">@cookbook_context</span>.depends [<span style="color: #5c3566;">"build-essential"</span>,<span style="color: #5c3566;">"bob"</span>]
<span style="color: #346604;">end</span>
</pre>

<p>
Unfortunately this would require the cookbook loader to essentially run twice.  
</p></div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Learning Curve</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>Most people came to the talk hoping to learn how to write a LWRP.  Unfortunately as there was no Projector no code was shared.
</p></div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-26T17:50-0700</p>
<p class="author">Author: Scott M. Likens</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.8.11 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
